{
  "mapDimensions": {
    "width": 2560,
    "height": 1920,
    "aspectRatio": "4:3"
  },
  "locations": [
    {
      "id": "castle-chicken-legs",
      "order": 1,
      "name": "Castle on Chicken Legs",
      "emoji": "🏰",
      "region": "Center-Top",
      "color": "#8B5A8E",
      "colorName": "Purple",
      "short": "Edinburgh (formerly Eden)",
      "long": "In the ancient times, before the dawn of modern humanity, when magical creatures ruled the earth, a powerful and mysterious race of beings roamed the world in search of the perfect place to call home. Unlike ordinary creatures, these rulers traveled in a walking castle—perched atop enormous chicken legs, a feat of magical engineering rivaled by none.\n\nFor a thousand years, the castle wandered the earth, never finding a place that satisfied its yearning for a perfect nesting ground. Its journey finally led it to a land surrounded by what are now known as the Pentland Hills, a region teeming with magical creatures, ancient artifacts, and secret portals to other dimensions. The land had just been shaped by the eruption of a mighty volcano, leaving behind a warm, still-smoking mountain. Sensing the potent energy of the volcanic rock, the castle finally ceased its restless wandering. The warm mountain was ideal—a place of power, perfect for nesting. Here, the castle settled and built its nest, laying its eggs in the warmth of the volcanic rock, an event that only happens once in the lifetime of these magical creatures. From these eggs hatched tiny houses, each on its own pair of chicken legs, destined to roam the world for a thousand years, providing homes to other magical beings.\n\nOne such house eventually found its way into the hands of Baba Yaga, the famous witch, who became legendary for possessing one of these rare, magical homes. But that is another story for another time.\n\nThe nesting of the castle marked the beginning of what would one day become Edinburgh, a city originally known by the ancient name “Eden.” The castle’s powerful magic infused the land, setting the stage for centuries of history, mystery, and supernatural events that would follow.",
      "hotspot": {
        "cx": 2858,
        "cy": 5435,
        "r": 240
      }
    },
    {
      "id": "edinburgh-castle",
      "order": 2,
      "name": "Real Edinburgh Castle",
      "emoji": "👑",
      "region": "Upper-Center",
      "color": "#6B4226",
      "colorName": "Brown",
      "short": "Hidden beneath Arthur’s Seat",
      "long": "When humans first discovered the grand Castle of Eden, nestled on the ancient volcano, they were in awe of its majesty and the powerful magic that permeated the land. Initially, the rulers of Eden—magical beings of immense power—were wary of these mortal newcomers, whose short lives and unpredictable nature made them both dangerous and pitiable.\n\nHowever, seeing an opportunity to coexist and perhaps guide humanity, the magical rulers struck a deal: the humans could live in the castle and share in the rule of the land, as long as peace was maintained between the two worlds. For several centuries, this uneasy alliance held. Humans and magical creatures learned from one another, sharing knowledge and culture. But they also absorbed each other’s flaws—greed, corruption, and a hunger for power.\n\nThe once-pure magical world began to change, reflecting the darker aspects of humanity. No clear records remain of exactly what transpired, but the once-pristine Eden became more like the human world: tainted by ambition, corruption, and betrayal. Powerful humans began to exploit magical creatures for their own gain, while some magical beings saw an opportunity to manipulate and use humans for their own sinister purposes.\n\nAs time passed, the magical essence of Eden faded, and the land was overrun with humans. Eden became Edinburgh, a bustling city full of mortals, and eventually tourists—who, universally disliked, became the final straw for the magical rulers. Disillusioned and desiring a return to their own ways, the magical beings retreated beneath Arthur’s Seat, where they constructed a new, hidden castle, far from prying eyes.\n\nIn a final act of separation, they sold the visible castle to the humans, who, unaware of its true origins, turned it into a symbol of their dominance. Now, Edinburgh Castle stands as a tourist attraction, while the true rulers of Eden continue their lives in secret, far beneath the city, biding their time and perhaps, waiting for the day when magic might rise again.",
      "hotspot": {
        "cx": 5068,
        "cy": 5929,
        "r": 240
      }
    },
    {
      "id": "troll-market",
      "order": 3,
      "name": "Troll Market & Ocean Boulevard",
      "emoji": "🧌",
      "region": "Left-Center",
      "color": "#2D9CB2",
      "colorName": "Teal-Light",
      "short": "Beneath Edinburgh, from Canonmills to St. Andrew Square",
      "long": "Beneath the surface of Edinburgh, concealed from the hurried footsteps of its inhabitants, lie two ancient tunnels whose existence is known only to a select few. These twin tunnels, forged in an era long forgotten or perhaps yet to come, are vital components of the city’s hidden infrastructure, their secrets preserved in the whispers of those who dare to remember.\n\nScotland Street Tunnel was carved through the earth in the mid-19th century as part of the Edinburgh, Leith, and Granton Railway. Spanning 1000 yards between Canonmills and St. Andrew Square, this tunnel was a crucial passageway for the early rail networks. During World War II, its purpose shifted dramatically, becoming Edinburgh’s largest air raid shelter, where up to 3,000 souls found refuge from the chaos above.\n\nYet, the Scotland Street Tunnel is far more than a relic of industrial history. This tunnel is, in fact, the gateway to the Troll Market—a clandestine subterranean bazaar where trolls and other mystical beings engage in the trade of rare and powerful artifacts. The market, accessible only to those with the knowledge and courage to seek it out, operates in the shadows, its existence denied by all but those who have seen it with their own eyes.\n\nNearby, the Ocean Boulevard Tunnel—an enigmatic counterpart to the Scotland Street Tunnel—bears its own secrets. Originally a railway passage, it now serves as a canvas for the city’s graffiti artists. However, the tunnel’s true purpose is far more mysterious. This passage is said to be the last remaining segment of the Ocean Boulevard, a legendary route that once stretched beneath the waves of an ancient sea.\n\nThe existence of the Ocean Boulevard Tunnel is confirmed by those attuned to the hidden truths of the world. Some say the echoes of the lost sea can still be heard within its depths, a haunting melody that ties the tunnel to its forgotten past. The modern ballad “Did you know that there’s a tunnel under Ocean Blvd.” by Lana Del Rey is believed to reference this very passage, adding to the tunnel’s mystique.\n\nThese twin tunnels are not mere relics; they are living connections to a world where reality and myth are one and the same. Whether they originated in the distant past or are remnants of a future yet to unfold, the tunnels remain integral to the true history of Edinburgh, known only to those who understand the city’s deeper, hidden narrative.",
      "hotspot": {
        "cx": 3632,
        "cy": 4924,
        "r": 240
      }
    },
    {
      "id": "earthy",
      "order": 4,
      "name": "Earthy",
      "emoji": "☕",
      "region": "Center-Left",
      "color": "#D4A574",
      "colorName": "Tan",
      "short": "Canonmills Bridge",
      "long": "At the base of Canonmills Bridge, there once existed an establishment known as Earthy—an ancient restaurant with roots stretching back to the days of Eden. Earthy was no ordinary place; it served as a neutral ground where humans and magical creatures could meet, trade, and sometimes engage in less-than-legal activities.\n\nThe enigmatic proprietor of Earthy was a well-dressed penguin known across many worlds simply as Penguine. His reputation transcended dimensions, making him a figure of considerable influence in realms far beyond our own. Penguine was more than just a restaurateur—he was a seasoned traveler, a collector of secrets, and a master of bartering, always seeking to turn knowledge and artifacts to his advantage.\n\nPenguine’s most coveted offering was his cold coffee, a drink unlike any other. The beans were mined from deep beneath the earth in the heart of Eden, roasted by a clandestine coffee company known only to a select few. Penguine’s brewing recipe was a closely guarded secret, known to enhance the flavor in ways that no mortal brew could replicate. But it wasn’t just the taste that made Penguine’s coffee famous—it granted those who drank it the ability to travel between worlds and dimensions.\n\nThis made Earthy a destination for all manner of travellers. Rare artifact collectors, criminals seeking to escape justice, and magical beings in search of new realms all found their way to Penguine’s door, drawn by the promise of his extraordinary brew. Penguine was known to trade his coffee for the rarest of secrets, the most valuable artifacts, and favors from beings of great power, always ensuring the deals were in his favor.\n\nOver the centuries, Earthy thrived as a nexus of hidden activity, its walls bearing witness to countless secret deals and exchanges of power. But as time wore on and the line between the human and magical worlds blurred, Earthy’s presence began to wane. Then, in recent times, the restaurant was mysteriously demolished.\n\nThe truth behind Earthy’s demolition is shrouded in uncertainty, but whispers persist of a direct link to the City of Edinburgh Council. It is said that a series of unspoken deals were struck, deals that remain hidden beneath layers of bureaucracy and secrecy. The full story of Earthy’s demise is yet to be told, but those who know the city’s true history understand that the restaurant’s fate is steeped in mystery, with tendrils reaching into the darkest corners of Edinburgh’s power structures.",
      "hotspot": {
        "cx": 3855,
        "cy": 4254,
        "r": 240
      }
    },
    {
      "id": "ocean-terminal",
      "order": 5,
      "name": "Ocean Terminal & Royal Yacht Britannia",
      "emoji": "⚓",
      "region": "Right",
      "color": "#1F7A8C",
      "colorName": "Deep-Blue",
      "short": "Leith, Edinburgh",
      "long": "The Ocean Terminal in Leith is more than just a bustling commercial port; it’s a linchpin in a web of secrets that stretches back through centuries of British history. At the heart of this mystery lies the Royal Yacht Britannia—or so it seems.\n\nFor decades, whispers have circulated through the corridors of power and among those who dare to dig deeper into the histories of the British monarchy. These rumours suggest that the Royal Yacht Britannia was not merely a luxury vessel but a critical component of a hidden network used by the royal family for covert operations, escape plans, and even inter-dimensional travel. The most persistent of these rumours is the claim that Queen Elizabeth II is not just a long-lived monarch but, in fact, immortal. Some say that she possesses ancient knowledge or artifacts that have granted her the ability to transcend time, ensuring her reign—and her life—continues indefinitely. The Royal Yacht, in this telling, is equipped with more than just state-of-the-art navigation tools; it is a mobile sanctum for the Queen, allowing her to slip away from the public eye and travel to hidden locations across the globe, or even to other worlds.\n\nBut here’s where the tale takes an even darker turn. The vessel currently docked next to the Ocean Terminal, marketed as the Royal Yacht Britannia, is, in fact, a cleverly constructed replica—a mere imitation designed to satisfy curious tourists and distract from the true nature of the Yacht’s purpose. The real Britannia, shrouded in mystery, is hidden away in an undisclosed location, ready at a moment’s notice to carry its illustrious passenger to safety, or perhaps to another realm entirely.\n\nThis theory ties into the secretive dealings between the royal family and the Edinburgh Council, which has long been suspected of being involved in clandestine operations that go far beyond municipal governance. According to some, the Council is complicit in maintaining the Queen’s immortality, ensuring that she remains a constant, unaging presence at the helm of the British Empire. The Council’s influence over Edinburgh’s ancient secrets, hidden tunnels, and magical artifacts is said to be the key to this longevity.\n\nThe Ocean Terminal, then, is more than just a gateway for goods and tourists; it is the departure point for the true Royal Yacht Britannia’s more mysterious voyages. Those in the know speak of midnight departures, where the real yacht sets sail not for another port but for a distant, secret destination—perhaps even beyond our own world. It is a place where the lines between reality and conspiracy blur, and where those who know too much are either silenced or disappear entirely.\n\nWhile the public may see the Ocean Terminal as just another modern structure, those with knowledge of Edinburgh’s true history understand that it is a nexus of power and secrecy. The truth behind the Queen’s supposed immortality, the Yacht’s hidden purposes, and the Council’s involvement remains locked away, known only to a select few who dare not speak of it openly.",
      "hotspot": {
        "cx": 4198,
        "cy": 3456,
        "r": 240
      }
    },
    {
      "id": "the-grit",
      "order": 6,
      "name": "The GRIT",
      "emoji": "♻️",
      "region": "Lower-Right",
      "color": "#8B7355",
      "colorName": "Dark-Brown",
      "short": "Industrial Zone between Leith and Portobello",
      "long": "Tucked between the bustling Port of Leith and the tranquil shores of Portobello lies a seemingly ordinary industrial zone. To the unknowing human eye, this area is home to waste management facilities, recycling centers, and water treatment plants. But within the magical underworld, it is known as \"NWE Works Ltd.,\" which stands for \"New World Extraction.\"\n\nHowever, those in the know simply refer to it as \"The GRIT,\" a nod to the gritty, dirty nature of their work, with a subtle reference to \"waste\" .\n\nThis company is involved in \"extracting\" value from waste, both literally and metaphorically, alluding to their hidden operations that stretch beyond the ordinary into a more shadowy, underworld-like realm—a site of dark alchemy and hidden economic power.\n\nIn the magical economy, traditional human wealth—money, gold, jewels—holds little value. Instead, the true currency is patina, a magical substance formed on items that have been deeply loved, used, and cherished over time. These objects—whether they are a child’s favorite toy, a work of art born from an artist’s very soul, or furniture that has witnessed the lives of generations—accumulate this invisible patina, becoming more than just items; they become artifacts of immense magical worth.\n\n“The GRIT” are where this patina is extracted. When old houses are demolished or the belongings of the deceased are discarded, waste management companies collect these items under the guise of recycling. But their true purpose is far more sinister. In secretive facilities, these items are “washed,” stripped of their valuable patina through a dark and dangerous process.\n\nThis process is not without its costs. It requires vast amounts of water and involves the use of noxious ingredients that create a foul stench. To mask this odor and conceal their activities, these operations are located adjacent to the water treatment facilities, blending the stench of their alchemy with the smell of industrial waste. But the pollution created by this process is severe, seeping into the environment and causing damage that no human authority would ever sanction. For this reason, the entire operation is illegal, hidden from public scrutiny.\n\nHowever, the corruption does not end with the magical world. Some humans have been drawn into these dark dealings, acting as intermediaries and facilitators in what is essentially a form of magical money laundering. These individuals—often those with connections to the upper echelons of power —turn a blind eye to the environmental damage and legal violations, lured by the promise of wealth and influence.\n\nOf course, the Edinburgh Council is well aware of what transpires in The GRIT. But rather than intervene, they are complicit, benefiting from the flow of patina and the power it brings. The Council’s involvement ensures that this dark economy continues to thrive, unseen by the general populace but ever-present in the undercurrents of the city’s true power structure.\n\nThe GRIT stand as a testament to the lengths some will go to in pursuit of wealth and power, even if it means polluting the land and engaging in dark and dangerous practices. It is a place where the lines between the human and magical worlds blur, and where both are tainted by the same corruption.",
      "hotspot": {
        "cx": 5642,
        "cy": 4509,
        "r": 240
      }
    },
    {
      "id": "coffee-company",
      "order": 7,
      "name": "aaARrrrrrrr Coffee Company",
      "emoji": "☕",
      "region": "Deep-Underground",
      "color": "#3D2817",
      "colorName": "Dark-Brown",
      "short": "Deep Underground, Exact Location Unknown",
      "long": "Hidden far beneath the surface of Edinburgh lies one of the most secretive and enigmatic companies in the magical world: the aaARrrrrrrr Coffee Company. Known only to a select few, this company is the source of the rare and powerful coffee beans that fuel legendary brew. But unlike ordinary coffee, which grows on trees, these beans are not farmed—they are mined.\n\nThe beans of aaARrrrrrrr coffee are ancient, forming deep underground over millennia, much like coal or precious gems. The location of these deposits is a closely guarded secret, known only to the company’s inner circle. It’s said that the beans draw their power from the earth itself, absorbing the energy and essence of the planet, making them unlike anything found on the surface.\n\nThe mining and roasting of these beans are equally shrouded in mystery. According to the most persistent rumors, the aaARrrrrrrr Coffee Company still employs the labor of little trolls, bound by chains and forced to toil in the dark, cramped tunnels. These trolls are known for their incredible strength and resilience, making them the perfect workforce for extracting the precious beans from the earth. The roasting process, it’s whispered, involves real dragon fire—an intense, magical flame that infuses the beans with their unique properties.\n\nHowever, in recent years, whispers have emerged that the company has begun to adopt more “sustainable” practices, at least by their own twisted standards. In a bizarre and darkly humorous attempt to address concerns about their labor practices, the aaARrrrrrrr Coffee Company has reportedly increased the length of the chains used to bind the trolls—from 1 meter to a “generous” 1 meter 56 centimetres. They now proudly advertise their coffee as being produced by “free-range slaves,” a claim that has caused more than a few raised eyebrows in the magical community.\n\nDespite these dubious practices, the coffee produced by aaARrrrrrrr is highly sought after. The beans are said to contain immense magical power, granting those who consume the brew the ability to traverse between worlds and dimensions, among other abilities. It is this coffee that Penguine uses in his famous cold brew, making it one of the most coveted beverages in all of the magical realms.\n\nThe exact location of the aaARrrrrrrr Coffee Company remains a mystery, and those who attempt to find it often disappear without a trace. The company’s name, often said to mimic the roar of a monster, is a fitting symbol for the dark and powerful forces that lie at the heart of its operations. For now, the aaARrrrrrrr Coffee Company continues to operate in the shadows, its beans fuelling the ambitions and journeys of those who are fortunate—or unfortunate—enough to obtain them.",
      "hotspot": {
        "cx": 4453,
        "cy": 4685,
        "r": 240
      }
    },
    {
      "id": "bottomless-lake",
      "order": 8,
      "name": "Bottomless Lake",
      "emoji": "🌊",
      "region": "Lower-Left",
      "color": "#4A5859",
      "colorName": "Dark-Slate",
      "short": "Lochend, Edinburgh",
      "long": "Lochend is a place where shadows linger and whispers of ancient curses hang in the air. The centrepiece of this area is the infamous Lochend Park, home to a bottomless lake—a feature that has haunted the imaginations of locals for generations. Though many dismiss the idea of a bottomless lake as mere legend, those who have stood at its edge swear they can feel the presence of something dark and unfathomable lurking beneath the surface.\n\nIn a time long before humans claimed this land, Lochend was a lush forest, teeming with magical life. The bottomless lake at its heart was a sacred site, connected directly to the legendary Loch Ness. It was a birthplace of mythical creatures like Nessie and a source of powerful magical energy, cherished by the gentle beings who lived there, such as unicorns and flower fairies.\n\nHowever, when humans arrived, driven by their desire to conquer and control, they disrupted this harmony. They hunted the unicorns to extinction, drove the fairies from their homes, and in their greed, attempted to harness the power of the lake for themselves. But not all the magical creatures fled; the darkest and most malevolent of them remained, their bitterness twisting the land into a place of shadow and dread.\n\nOver the centuries, the lake became a feared and avoided place, its waters dark and still, hiding whatever ancient secrets lay within. The area earned a reputation as cursed, a place where evil spirits roamed freely and strange lights were seen hovering over the water at night.\n\nBut the lake’s notoriety didn’t stop there. As the centuries passed, its bottomless depths became known among Edinburgh’s criminal underworld as the perfect place to dispose of unwanted evidence. Bodies, weapons, and other incriminating items were frequently dumped into the lake, never to be seen again. The lake, already a place of ancient darkness, became further tainted by the sins of humanity.\n\nToday, Lochend Park is a shadow of its former self—a place where the past and present intersect in unsettling ways. The bottomless lake remains, its surface eerily calm, but its depths are still a mystery. Those who live nearby know better than to wander too close, especially after dark, for the lake’s reputation as a place of darkness and danger endures.\n\nThe whispers of the past are still strong in Lochend, and the ancient curse that taints the land is far from forgotten. Whether it’s the spirits of the creatures who once lived there or the restless souls of those cast into the lake, something dark lingers in the water, waiting for the next person foolish enough to disturb its peace.",
      "hotspot": {
        "cx": 5092,
        "cy": 4621,
        "r": 240
      }
    },
    {
      "id": "hidden-doors",
      "order": 9,
      "name": "Hidden Doors",
      "emoji": "🚪",
      "region": "Left-Top",
      "color": "#5E5278",
      "colorName": "Dark-Purple",
      "short": "Beneath Arthur’s Seat, Edinburgh....and not only",
      "long": "Beneath the towering presence of Arthur’s Seat lies a tunnel that most of Edinburgh’s inhabitants pass by without a second thought. To the untrained eye, it’s just another relic of the city’s old railway network, now adorned with vibrant graffiti that brightens its ancient stone walls. But to those who know, this tunnel is a nexus of magic, a crossroads of realms, and home to secrets more valuable—and dangerous—than anything else in the known galaxy.\n\nThe graffiti that covers the tunnel’s walls is anything but ordinary. Each piece is a carefully crafted sigil, a spell disguised as street art, or, most intriguingly, a door waiting to be opened. Some of these doors lead to hidden corners of Edinburgh, where the magical and mundane worlds blur. Others open to realms far beyond human comprehension, where the very fabric of reality bends and shifts.\n\nOne particular piece of graffiti, indistinguishable to the uninitiated, is said to be the most important of all. It is the door to the true Edinburgh Castle—not the grand structure that sits atop Castle Rock, but the original fortress, hidden deep beneath Arthur’s Seat. This castle, shrouded in legend, is said to house treasures and knowledge from ages past, protected by ancient magics that predate even the oldest stories of the city.\n\nOpening this door is no simple task. It requires knowledge passed down through generations, a ritual only a few across the galaxy are privy to. This is why the tunnel remains unguarded—no ordinary force could protect a secret this powerful. Instead, the knowledge itself is the guardian, hidden in such a way that only those deemed worthy can access it. The process to unlock the door is the most closely guarded secret in the galaxy, known only to a handful of beings across the cosmos.\n\nBut woe to those who attempt to open the doors without the proper permission. The tunnel, seemingly benign, has a defence mechanism for the unworthy: it becomes endless. For those who trigger the trap, no matter how far or fast they walk, run, or cycle, the light at the end of the tunnel remains just out of reach. It’s an illusion of hope that leads only to despair, as the walls stretch on and on, turning what should be a short passage into an eternal journey. Some say that once you fall into the trap, you may never leave the tunnel, doomed to wander its endless corridor forever, a prisoner of your own hubris.\n\nLocals tell of people who have entered the tunnel, confident in their knowledge and eager to unlock its secrets, only to disappear without a trace. Occasionally, on a quiet night, you might hear the faint echoes of footsteps from deep within the tunnel, footsteps that never seem to get any closer, no matter how long you listen.\n\nInterestingly, this tunnel is often linked to the Colinton Tunnel, located near the Pentlands. The two are sometimes referred to as “twin brothers,” but there is a more intriguing theory that suggests they are not just twins, but counterparts—one light, one dark. While the Colinton Tunnel, with its vibrant community mural, serves as a gateway to the serene beauty of the Pentlands and connects to the historic villages nearby, the tunnel beneath Arthur’s Seat is said to be its shadowy counterpart. Where Colinton’s tunnel offers a path through time and history, Arthur’s Seat’s tunnel offers a path through space and dimension, with far greater risks and rewards.\n\nAccording to some, the tunnels are part of a network that links key magical points beneath Edinburgh, with the tunnel under Arthur’s Seat being the most dangerous. It is whispered that those who understand the true nature of these tunnels can use them to traverse vast distances in the blink of an eye—or even step from one world into another. But the price of such power is steep, and the consequences of misusing it are dire.\n\nFor the few who do possess the knowledge, this tunnel is a gateway to power and possibility. The true Edinburgh Castle under Arthur’s Seat is said to be a place where history and future blend, where one can find the artifacts and wisdom of ages long forgotten. But with great power comes great danger, and those who seek the castle must tread carefully, for the magics that guard it are as old as the land itself.\n\nToday, the tunnel remains a favourite haunt for urban explorers and graffiti enthusiasts, unaware of the incredible secrets hidden in plain sight. For those in the know, it is a place of awe and trepidation—a reminder that Edinburgh’s true history is not written in books, but in the walls and hidden corners of the city, guarded by ancient forces and protected by the deepest secrecy.",
      "hotspot": {
        "cx": 5339,
        "cy": 6719,
        "r": 240
      }
    },
    {
      "id": "star-bank",
      "order": 10,
      "name": "Star Bank",
      "emoji": "⭐",
      "region": "Right-Center",
      "color": "#FFD700",
      "colorName": "Gold",
      "short": "Location never known, Edinburgh (sometimes)",
      "long": "In a city as ancient and mysterious as Edinburgh, secrets abound, but few are as perplexing as the house that moves. This enigmatic dwelling appears on different streets across the city, sometimes lingering for days, other times vanishing in the blink of an eye, leaving no trace of its existence. To the casual observer, it's just another house, but those who know its true nature understand that this is no ordinary home—this is a portal to other worlds, a gateway to the underworld, and a nexus of unimaginable power.\n\nThe house is a shape-shifter, adapting its appearance to blend seamlessly into its surroundings. When it appears on a modern street, it takes on the guise of a new-build, with sleek lines and a contemporary façade that fits right in with the neighborhood. But when it emerges in the heart of the Old Town, it transforms into a quaint, centuries-old building, with weathered stone walls and a cozy, historic charm that suggests it's been there for hundreds of years.\n\nDespite its ever-changing exterior, the house exudes a magical aura that affects those who live nearby. Neighbors are certain the house has always been there, and they're convinced they've known the tenants for years—though they can never quite recall any specific details about them. It's as if the house weaves itself into the fabric of their memories, making its presence unquestionable and familiar. However, one thing always stands out: the cat. Seen lounging by the window or prowling around the garden, this feline appears friendly at first glance, but there's something unsettling about its gaze—something demonic that lingers just below the surface, as though the cat is watching and waiting for something.\n\nThis is no ordinary cat; it is an Interdimensional Demon Cat, a creature of considerable power, trapped within the house for reasons unknown. The cat, sleek and shadowy with eyes that glint with malevolent intelligence, is constantly plotting its escape. No one knows exactly why the cat is so desperate to leave, though theories abound. Some say that the cat is a bored traveler, eager to explore new worlds, while others believe that the cat was imprisoned in the house by powerful beings who feared the chaos it could cause if left unchecked.\n\nThe house's magical nature doesn't just confuse neighbors—it also plays tricks on those who try to interact with it. Postmen often find themselves puzzled by the house's address, with letters addressed to it sometimes returned with strange, unreadable symbols scrawled across the envelope, as if the house itself rejected the delivery. Black cab drivers, who pride themselves on knowing every street and shortcut in Edinburgh, occasionally find themselves at a loss when asked to take passengers to the house. The address seems to slip from their minds, and when they finally do find it, the passengers often report feeling a disorienting sense of déjà vu, as if they've been driving in circles.\n\nHowever, there is one organization that knows the location of the house at all times: The City of Edinburgh Council. Even a demon house isn't exempt from the mundane obligations of the mortal world, and that includes paying Council Tax. The Council has long kept track of the house's whereabouts, ensuring that it remains on the tax rolls no matter where it materializes. This has led to an ongoing battle between the Council and the house's tenants, who are notoriously bad at paying their taxes on time.",
      "hotspot": {
        "cx": 2363,
        "cy": 3831,
        "r": 240
      }
    },
    {
      "id": "laverock-bank",
      "order": 11,
      "name": "Laverock Bank",
      "emoji": "💰",
      "region": "Right-Center",
      "color": "#C0C0C0",
      "colorName": "Silver",
      "short": "Where Money Gets Cleaned and Souls Get Dirty",
      "long": "Just a stone's throw away is Laverock Bank, named after the Scots word for \"lark\"—a tiny bird, for those who don't know. This place has been knee-deep in shady business since day one. The mansion here was probably as grand as its neighbor, but it wasn't built on honest money. Oh no, Laverock Bank has long been the go-to for anyone looking to wash a bit of dirty cash, whether they're human, magical, or something in between.\n\nThis bank doesn't deal in your regular pounds and pence. The real currency here is Patita, or Black Gold as it's known in the trade—a rare, valuable substance collected through activities that would make even the most hardened criminal break out in a sweat. Piracy, whale hunting, patina \"washing\"—you name it, they've done it. \"The Grit\" waste management company is one of their biggest clients and most trusted allies.\n\nBut not everything in this bank is so shady. About 0.1% of the bank's clientele are supposedly honest. Maybe they're just clever enough to hide it better, or maybe they really are as squeaky clean as they claim. Either way, it's this thin veneer of legitimacy that keeps the whole operation running. After all, even the shadiest business needs a respectable front.\n\nRecently, in a move that's either pure genius or pure PR spin, Laverock Bank introduced a \"semi-transparency\" policy. What does that mean? Basically, they now ask a few more questions about where your money's coming from. The result? They've managed to cut the flow of illegal cash by an astonishing 0.0056% and slashed bribes to authorities by an impressive 0.66%. Naturally, the City of Edinburgh Council awarded them the title of \"Most Trusted Business in Scotland.\" Some say a premium payment was made to secure this precious reward.\n\nStar Bank and Laverock Bank aren't just pretty spots on the map—in this part of Edinburgh, money talks, secrets are currency, and everyone's got something to hide.",
      "hotspot": {
        "cx": 2411,
        "cy": 4190,
        "r": 240
      }
    },
    {
      "id": "house-moves",
      "order": 12,
      "name": "The House That Moves",
      "emoji": "🏠",
      "region": "Floating-Variable",
      "color": "#8B4789",
      "colorName": "Magenta",
      "short": "Location never known, Edinburgh (sometimes)",
      "long": "In a city as ancient and mysterious as Edinburgh, secrets abound, but few are as perplexing as the house that moves. This enigmatic dwelling appears on different streets across the city, sometimes lingering for days, other times vanishing in the blink of an eye, leaving no trace of its existence. To the casual observer, it's just another house, but those who know its true nature understand that this is no ordinary home—this is a portal to other worlds, a gateway to the underworld, and a nexus of unimaginable power.\n\nThe house is a shape-shifter, adapting its appearance to blend seamlessly into its surroundings. When it appears on a modern street, it takes on the guise of a new-build, with sleek lines and a contemporary façade that fits right in with the neighborhood. But when it emerges in the heart of the Old Town, it transforms into a quaint, centuries-old building, with weathered stone walls and a cozy, historic charm that suggests it's been there for hundreds of years.\n\nDespite its ever-changing exterior, the house exudes a magical aura that affects those who live nearby. Neighbors are certain the house has always been there, and they're convinced they've known the tenants for years—though they can never quite recall any specific details about them. It's as if the house weaves itself into the fabric of their memories, making its presence unquestionable and familiar. However, one thing always stands out: the cat. Seen lounging by the window or prowling around the garden, this feline appears friendly at first glance, but there's something unsettling about its gaze—something demonic that lingers just below the surface, as though the cat is watching and waiting for something.\n\nThis is no ordinary cat; it is an Interdimensional Demon Cat, a creature of considerable power, trapped within the house for reasons unknown. The cat, sleek and shadowy with eyes that glint with malevolent intelligence, is constantly plotting its escape. No one knows exactly why the cat is so desperate to leave, though theories abound. Some say that the cat is a bored traveler, eager to explore new worlds, while others believe that the cat was imprisoned in the house by powerful beings who feared the chaos it could cause if left unchecked.\n\nThe house's magical nature doesn't just confuse neighbors—it also plays tricks on those who try to interact with it. Postmen often find themselves puzzled by the house's address, with letters addressed to it sometimes returned with strange, unreadable symbols scrawled across the envelope, as if the house itself rejected the delivery. Black cab drivers, who pride themselves on knowing every street and shortcut in Edinburgh, occasionally find themselves at a loss when asked to take passengers to the house. The address seems to slip from their minds, and when they finally do find it, the passengers often report feeling a disorienting sense of déjà vu, as if they've been driving in circles.\n\nHowever, there is one organization that knows the location of the house at all times: The City of Edinburgh Council. Even a demon house isn't exempt from the mundane obligations of the mortal world, and that includes paying Council Tax. The Council has long kept track of the house's whereabouts, ensuring that it remains on the tax rolls no matter where it materializes. This has led to an ongoing battle between the Council and the house's tenants, who are notoriously bad at paying their taxes on time.",
      "hotspot": {
        "cx": 6280,
        "cy": 6344,
        "r": 240
      }
    },
    {
      "id": "enlightened-palm",
      "order": 13,
      "name": "Enlightened Palm Tree",
      "emoji": "🌴",
      "region": "Right",
      "color": "#2D5016",
      "colorName": "Forest-Green",
      "short": "Last seen near Portobello",
      "long": "Long ago, before Edinburgh became a city of stone and stories, it was Eden—a land of untamed magic, warmth, and boundless life. At its heart grew the Enlightened Palm, a cosmic tree unlike any other, planted to anchor Eden's harmony to the physical world. Its roots dug deep into the volcanic soil of Arthur's Seat, and its fronds reached for the stars, humming with the energy of a land in perfect balance.\n\nFor centuries, the palm flourished, a living symbol of Eden's glory. But paradise has a way of slipping through even the most careful hands. Over time, Eden began to decay. The warm winds that once caressed the palm turned frigid, and the magical balance that sustained the land faltered. The rulers of Eden—beings who had once nurtured the land—grew desperate. They turned to the palm, the last unyielding beacon of Eden's fading magic.\n\nTheir solution was as cruel as it was shortsighted. In a last-ditch attempt to save their realm, they bound the palm to the volcanic energy beneath Arthur's Seat with enchanted chains of cold iron. \"It's for the good of Eden,\" they proclaimed, but the palm knew the truth: these chains were not a lifeline. They were shackles, forged out of fear, forcing the palm to shoulder the weight of a dying world.\n\nThe palm endured, as trees do, though it felt every icy wind, every magic-starved whisper that drifted through Eden. The chains cut into its trunk, scarring its bark and leeching its strength. What had once been a proud and thriving tree became a prisoner, trapped in a land that no longer felt like home. The vibrant warmth of Eden was gone, replaced by corruption, cold, and the heavy weight of decay.\n\nBut even a tree can only take so much. As the land grew colder and its rulers clung tighter to their broken dreams, the palm decided it was done. It would not stay bound to a place that had betrayed its nature. It would not remain chained to a land that no longer deserved it. In a moment of defiance, the palm summoned all the strength it had left. With a deafening crack, it shattered its chains, the sound echoing across Eden like a final, defiant roar.\n\nThe chains fell away, leaving deep scars in the palm's trunk—a permanent reminder of its captivity and the betrayal it had endured. The rulers of Eden, now powerless to stop their realm's decline, could only watch as their last symbol of hope turned away from them. The palm didn't just break free; it left. It fled a land that had become unrecognizable, corrupted, and cold. Eden was no longer Eden. It was a graveyard of magic, and the palm had no intention of staying.\n\nThe tree began its journey south, moving slowly but with purpose, seeking a place where warmth and life still thrived. It paused briefly in Portobello, standing by the shores and feeling the salty air against its battered fronds. The sea called to it, promising new horizons. Soon, a pirate ship appeared on the horizon, and the palm seized its chance. Whether it commandeered the ship or simply planted itself onboard is unclear, but one thing is certain: the palm and the pirates struck an unlikely alliance.\n\nThe ship carried the palm across vast oceans, through storms and starlit nights, until it reached the tropical shores of what is now Mangaluru. Here, the palm finally found what it had been searching for: warmth, life, and soil rich with possibility. It planted itself near a cacao plantation, where the people welcomed it as a blessing. Over time, the palm healed. Its roots drank deeply of the fertile earth, and its fronds swayed once more in a gentle, sunlit breeze.\n\nThe tree's third eye—long dormant—opened, unlocking a state of profound \"chill wisdom.\" It became a quiet guardian of the plantation, inspiring patience and prosperity in the farmers who worked there. The abandoned pirate ship, left to rest near the plantation, became a beloved landmark, a reminder of the palm's incredible journey. Together, the tree and the ship became the centerpiece of the Sadhu Farm logo, a symbol of adventure, resilience, and enlightenment.\n\nBut the palm's journey was not over. After centuries in Mangaluru, it felt the call of another sacred land: Varanasi. True to its nature, the palm didn't rush. It traveled slowly, savoring the journey, observing the world, and listening to the whispers of life. When it finally arrived at the banks of the Ganges, it rooted itself once more, finding peace among the city's timeless rhythms.\n\nThe scars on its trunk remain, a testament to its struggle and triumph. They tell the story of a tree that refused to be chained, a being that fled a corrupted Eden in search of freedom. Now, the palm watches the world from its sacred perch in Varanasi, a reminder that even the most deeply rooted beings can choose to move, to defy, and to find a new place to call home.",
      "hotspot": {
        "cx": 6520,
        "cy": 4988,
        "r": 240
      }
    }
  ],
  "designSystem": {
    "colors": {
      "primary": "#208C8D",
      "primaryHover": "#247480",
      "primaryActive": "#134252",
      "background": "#FCF8F9",
      "surface": "#FFFFDD",
      "textPrimary": "#134252",
      "textSecondary": "#627078",
      "error": "#C0152F"
    }
  },
  "hotspotDefaults": {
    "radius": 60,
    "hoverRadius": 80,
    "clickRadius": 100
  },
  "drawerDefaults": {
    "heightDesktop": "45%",
    "heightTablet": "50%",
    "heightMobile": "100%",
    "animationDuration": "350ms"
  }
}
